// 06_for.js
// todo 4) 반복문? 코딩라인을 획기적으로 줄일수 있다.
// todo 안녕 5번 : 콘솔탭 표시
// console.log("안녕");
// console.log("안녕");
// console.log("안녕");
// console.log("안녕");
// console.log("안녕");
// todo : 사용법) for( let 변수=0; i<반복횟수;변수++){실행문;}
// todo : 해석)
// todo : 증감식) i++;(i의값이 1씩 증가), i--;(i의 값이 1씩 감소)

    // 1) i=0 -> 0<5(참) ->반복(i++: i 1증가) {실행문 실행}
    // 1) i=1 -> 1<5(참) ->반복(i++: i 1증가) {실행문 실행}
    // 1) i=2 -> 2<5(참) ->반복(i++: i 1증가) {실행문 실행}
    // 1) i=3 -> 3<5(참) ->반복(i++: i 1증가) {실행문 실행} 
    // 1) i=4 -> 4<5(참) ->반복(i++: i 1증가) {실행문 실행}
    // 1) i=5 -> 5<5(참) ->중단 (중괄호 빠져나와 다음라인 실행)
//     for(let i=0;i<5;i++){
//     console.log("안녕");
// }